const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7', ()=> {
  expect(sum(2,5)).toBe(7);
});

test('2 + 9 เท่ากับ 11', ()=> {
  expect(sum(2,9)).toBe(11);
});

test('8 + 9 เท่ากับ 17', ()=> {
  expect(sum(8,9)).toBe(17);
});

test('12 + 9 เท่ากับ 21', ()=> {
  expect(sum(12,9)).toBe(21);
});
// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
